---
kind: property
id: P:Autodesk.Revit.DB.APIObject.IsReadOnly
source: html/d516bcd2-a3fd-a578-58f6-f1add979bd07.htm
---
# Autodesk.Revit.DB.APIObject.IsReadOnly Property

Identifies if the object is read-only or modifiable.

## Syntax (C#)
```csharp
public virtual bool IsReadOnly { get; }
```